#Если вы на  linux, чтобы сделать файл исполняемым 
#вам нужно прописать путь до скрипта интепритатора !/home/путь/до/скрпта.py

#Для виндовс будет отдельный скомпилированный exe файл и нужно будет открывать файл .bsl с помощью exe -программы интепритатора

DEF <HELP>::PRINT Это справка!;;PRINT Это справка 2!;;FOR |2|:PRINTVAR i;PRINT Мы в цикле внутри функции
CALL HELP
# Это пример функции

LET string 'Hello World!'
PRINTVAR string

#Вывод содержимого переменной STR

#или 

STR string2 Hello World!
PRINTVAR string2

LET list ['hello','help',10]
PRINTVAR list

#Вывод списка, пока что списки можно только создавать, изменять нельзя, и доставать занчения по индексу тоже пока что нельзя

LET num #255

IF /@num == 255/:PRINT @num == 255

FOR |2|:PRINTVAR i;PRINT Мы в цикле FOR

# Это цикл FOR и Условие IF
